Display only the top 5 rows of all the staging tables and normalized tables to check whether they are all created successfully.

In [1]:
# import the packages
import configparser
from sqlalchemy import create_engine
import psycopg2

In [2]:
# Run sql query
%load_ext sql

In [3]:
# get the parameter from aws configure file
config = configparser.ConfigParser()
config.read_file(open('dwh.cfg'))

KEY =config.get('AWS', 'KEY')
SECRET =config.get('AWS', 'SECRET')

DWH_ENDPOINT = config.get("CLUSTER", "HOST")
DWH_DB = config.get("CLUSTER", "DB_NAME") 
DWH_DB_USER = config.get("CLUSTER", "DB_USER") 
DWH_DB_PASSWORD = config.get("CLUSTER", "DB_PASSWORD")
DWH_PORT = config.get("CLUSTER", "DB_PORT")

Connect to the database

In [4]:
# redshift connection
conn_string="postgresql://{}:{}@{}:{}/{}".format(DWH_DB_USER, DWH_DB_PASSWORD, DWH_ENDPOINT, DWH_PORT,DWH_DB)
#print(conn_string)
%sql $conn_string

'Connected: udacity-data-pipelines@dev'

## Staging tables

In [5]:
%%sql
SELECT * FROM airports LIMIT 5;

 * postgresql://udacity-data-pipelines:***@redshift-cluster-1.cxdkjytbphwr.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(2, '00AK', 'small_airport', 'Lowell Field', 450.0, 'AK', -151.696, 59.9492),
 (4, '00AL', 'small_airport', 'Epps Airpark', 820.0, 'AL', -86.7703, 34.8648),
 (10, '00CA', 'small_airport', 'Goldstone /Gts/ Airport', 3038.0, 'CA', -116.888, 35.3505),
 (16, '00FL', 'small_airport', 'River Oak Airport', 35.0, 'FL', -80.9692, 27.2309),
 (18, '00GA', 'small_airport', 'Lt World Airport', 700.0, 'GA', -84.0683, 33.7675)]

In [6]:
%%sql
SELECT * FROM cities LIMIT 5;

 * postgresql://udacity-data-pipelines:***@redshift-cluster-1.cxdkjytbphwr.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(0, 'Silver Spring', 'Maryland', 33.8, 40601, 41862, 82463, 1562, 30908, 2.6, 'MD', 1084.0, 8841.0, 21330.0, 25924.0, 37756.0),
 (2, 'Quincy', 'Massachusetts', 41.0, 44129, 49500, 93629, 4147, 32935, 2.39, 'MA', 351.0, 30473.0, 3917.0, 2566.0, 58723.0),
 (4, 'Hoover', 'Alabama', 38.5, 38040, 46799, 84839, 4819, 8229, 2.58, 'AL', None, 4759.0, 18191.0, 3430.0, 61869.0),
 (6, 'Rancho Cucamonga', 'California', 34.5, 88127, 87105, 175232, 5821, 33878, 3.18, 'CA', 2789.0, 24519.0, 24437.0, 65823.0, 111832.0),
 (8, 'Newark', 'New Jersey', 34.6, 138040, 143873, 281913, 5829, 86253, 2.73, 'NJ', 2268.0, 7349.0, 144961.0, 100432.0, 76402.0)]

In [7]:
%%sql
SELECT * FROM immigration LIMIT 5;

 * postgresql://udacity-data-pipelines:***@redshift-cluster-1.cxdkjytbphwr.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('5748518', 2016, 4, '245', '438', 'LOS', datetime.date(2016, 4, 30), 1, 'NV', datetime.date(2016, 5, 17), 32, 1, 1, datetime.date(2016, 4, 30), 'G', 'O', 'M', 1984, datetime.date(2016, 10, 29), 'F', 'VA', '94955622830', '00007', 'B1'),
 ('5748519', 2016, 4, '245', '438', 'LOS', datetime.date(2016, 4, 30), 1, 'WA', datetime.date(2016, 5, 8), 29, 1, 1, datetime.date(2016, 4, 30), 'G', 'O', 'M', 1987, datetime.date(2016, 10, 29), 'M', 'DL', '94956406530', '00040', 'B1'),
 ('5748520', 2016, 4, '245', '438', 'LOS', datetime.date(2016, 4, 30), 1, 'WA', datetime.date(2016, 5, 14), 29, 1, 1, datetime.date(2016, 4, 30), 'G', 'O', 'M', 1987, datetime.date(2016, 10, 29), 'F', 'DL', '94956451430', '00040', 'B1'),
 ('5748521', 2016, 4, '245', '438', 'LOS', datetime.date(2016, 4, 30), 1, 'WA', datetime.date(2016, 5, 14), 28, 1, 1, datetime.date(2016, 4, 30), 'G', 'O', 'M', 1988, datetime.date(2016, 10, 29), 'M', 'DL', '94956388130', '00040', 'B1'),
 ('5748522', 2016, 4, '245', '464', 'HHW', datetime.date(2016, 4, 30), 1, 'HI', datetime.date(2016, 5, 5), 57, 2, 1, datetime.date(2016, 4, 30), 'G', 'O', 'M', 1959, datetime.date(2016, 10, 29), 'M', 'NZ', '94981802830', '00010', 'B2')]

In [8]:
%%sql
SELECT * FROM temperature LIMIT 5;

 * postgresql://udacity-data-pipelines:***@redshift-cluster-1.cxdkjytbphwr.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(1, datetime.date(2003, 1, 1), 4.8, 0.1, 'Alabama'),
 (3, datetime.date(2003, 2, 1), 9.1, 0.2, 'Alabama'),
 (5, datetime.date(2003, 3, 1), 14.6, 0.2, 'Alabama'),
 (7, datetime.date(2003, 4, 1), 17.8, 0.2, 'Alabama'),
 (9, datetime.date(2003, 5, 1), 22.6, 0.2, 'Alabama')]

## Normalized tables

In [9]:
%%sql
SELECT * FROM dim_airports LIMIT 5

 * postgresql://udacity-data-pipelines:***@redshift-cluster-1.cxdkjytbphwr.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('KS', 373), ('FL', 523), ('KY', 165), ('VA', 311), ('IA', 231)]

In [10]:
%%sql
SELECT * FROM dim_cities LIMIT 5

 * postgresql://udacity-data-pipelines:***@redshift-cluster-1.cxdkjytbphwr.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('FL', 39.0, 3236773, 3487375, 6724148, 372997, 1684897, 2.8, 43541.0, 241587.5, 1517568.5, 1906897.5, 4439764.5),
 ('SC', 34.2, 260944, 272713, 533657, 33463, 27744, 2.5, 3492.0, 19852.3, 152653.3, 29162.7, 346412.7),
 ('WA', 35.3, 1245605, 1254502, 2500107, 153126, 440962, 2.6, 60248.0, 346995.0, 187584.0, 324070.0, 1913484.0),
 ('ID', 34.8, 199103, 199780, 398883, 26380, 28126, 2.7, 6705.0, 13985.0, 7822.0, 48142.0, 370314.0),
 ('MT', 35.5, 87707, 93587, 181294, 13854, 5977, 2.3, 9684.0, 4165.0, 3349.0, 10000.0, 169026.0)]

In [11]:
%%sql
SELECT * FROM dim_temperature LIMIT 5

 * postgresql://udacity-data-pipelines:***@redshift-cluster-1.cxdkjytbphwr.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('KS', 14.2, 25.6, 13.0, 0.3),
 ('OR', 9.5, 17.7, 7.5, 1.0),
 ('SD', 9.6, 21.8, 7.7, -6.2),
 ('MI', 10.0, 19.7, 6.6, -4.8),
 ('NV', 11.2, 21.8, 9.3, 0.1)]

In [12]:
%%sql
SELECT * FROM fact_immigration LIMIT 5

 * postgresql://udacity-data-pipelines:***@redshift-cluster-1.cxdkjytbphwr.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('5748518', 2016, 4, '245', '438', 'LOS', datetime.date(2016, 4, 30), 1, 'NV', datetime.date(2016, 5, 17), 32, 1, 1, datetime.date(2016, 4, 30), 'G', 'O', 'M', 1984, datetime.date(2016, 10, 29), 'F', 'VA', '94955622830', '00007', 'B1'),
 ('5748519', 2016, 4, '245', '438', 'LOS', datetime.date(2016, 4, 30), 1, 'WA', datetime.date(2016, 5, 8), 29, 1, 1, datetime.date(2016, 4, 30), 'G', 'O', 'M', 1987, datetime.date(2016, 10, 29), 'M', 'DL', '94956406530', '00040', 'B1'),
 ('5748520', 2016, 4, '245', '438', 'LOS', datetime.date(2016, 4, 30), 1, 'WA', datetime.date(2016, 5, 14), 29, 1, 1, datetime.date(2016, 4, 30), 'G', 'O', 'M', 1987, datetime.date(2016, 10, 29), 'F', 'DL', '94956451430', '00040', 'B1'),
 ('5748521', 2016, 4, '245', '438', 'LOS', datetime.date(2016, 4, 30), 1, 'WA', datetime.date(2016, 5, 14), 28, 1, 1, datetime.date(2016, 4, 30), 'G', 'O', 'M', 1988, datetime.date(2016, 10, 29), 'M', 'DL', '94956388130', '00040', 'B1'),
 ('5748522', 2016, 4, '245', '464', 'HHW', datetime.date(2016, 4, 30), 1, 'HI', datetime.date(2016, 5, 5), 57, 2, 1, datetime.date(2016, 4, 30), 'G', 'O', 'M', 1959, datetime.date(2016, 10, 29), 'M', 'NZ', '94981802830', '00010', 'B2')]